app/views/users/show.html.erb

  <strong>User's first micropost:</strong>
  <%= @user.microposts.first.try(:content) %>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]